Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x40002c00"/>
            <parameters>
              <param name="CC_NUM" value="3"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="26"/>
              <param name="DMAC_ID_MC_0" value="27"/>
              <param name="DMAC_ID_MC_1" value="28"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="1"/>
              <param name="GCLK_ID" value="5"/>
              <param name="MASTER_SLAVE_MODE" value="0"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="3"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="U2242" version="1.1.0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42002800"/>
            <parameters>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="02674" version="1.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x44000500"/>
          </instance>
        </module>
        <module name="CoreDebug" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
          </instance>
        </module>
        <module name="DWT" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
          </instance>
        </module>
        <module name="ETM" version="1.0.0">
          <instance name="ETM">
            <register-group name="ETM" name-in-module="ETM" address-space="base" offset="0xE0041000"/>
          </instance>
        </module>
        <module name="FPU" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
          </instance>
        </module>
        <module name="ITM" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0000000"/>
          </instance>
        </module>
        <module name="MPU" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="40" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="3" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="TPI" version="1.0.0">
          <instance name="TPI">
            <register-group name="TPI" name-in-module="TPI" address-space="base" offset="0xE0040000"/>
            <signals>
              <signal group="TRD" index="0" pad="PB05"/>
              <signal group="TRD" index="1" pad="PB06"/>
              <signal group="TRD" index="2" pad="PB07"/>
              <signal group="TRD" index="3" pad="PB04"/>
              <signal group="TRCLK" pad="PA07"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_TRACE" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="ZIGBEE" version="1.0">
          <instance name="ZIGBEE">
            <register-group name="ZIGBEE" name-in-module="ZIGBEE" address-space="base" offset="0x41010000"/>
          </instance>
        </module>
        <module name="ARB" version="1.0">
          <instance name="ARB">
            <register-group name="ARB" name-in-module="ARB" address-space="base" offset="0x41011000"/>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="MemoryManagement" index="-12" caption="Memory Management, MPU mismatch, including Access Violation and No Match" header:alternate-caption="Memory Management Fault"/>
        <interrupt name="BusFault" index="-11" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" header:alternate-caption="Bus Fault"/>
        <interrupt name="UsageFault" index="-10" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition" header:alternate-caption="Usage Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt name="DebugMonitor" index="-4" caption="Debug Monitor" header:alternate-caption="Debug Monitor"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="RTC" index="0" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="1" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="FREQM" index="2" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="FLASH_CONTROL" index="3" module-instance="NVM" caption="Non-Volatile Memory"/>
        <interrupt name="CHANGE_NOTICE_A" index="4" module-instance="GPIOA" caption="PORT_A_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="CHANGE_NOTICE_B" index="5" module-instance="GPIOB" caption="PORT_B_INPUT_CHANGE_INTERRUPT"/>
        <interrupt name="DMAC_0_3" index="6" module-instance="DMAC" caption="DMA Channel 0..3"/>
        <interrupt name="DMAC_4_15" index="7" module-instance="DMAC" caption="DMA Channel 4..X"/>
        <interrupt name="EVSYS_0_3" index="8" module-instance="EVSYS" caption="Event System Channel 0..3"/>
        <interrupt name="EVSYS_4_11" index="9" module-instance="EVSYS" caption="Event System Channel 4..X"/>
        <interrupt name="PAC" index="10" module-instance="PAC" caption="Peripheral Access Controller"/>
        <interrupt name="RAMECC" index="11" module-instance="RAMECC" caption="RAM Error Correction Code"/>
        <interrupt name="SERCOM0" index="12" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1" index="13" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="TCC0" index="16" module-instance="TCC0" caption="Timer/Counter for Control Applications 0"/>
        <interrupt name="TCC1" index="17" module-instance="TCC1" caption="Timer/Counter for Control Applications 1"/>
        <interrupt name="TCC2" index="18" module-instance="TCC2" caption="Timer/Counter for Control Applications 2"/>
        <interrupt name="TC0" index="19" module-instance="TC0" caption="Timer/Counter 0"/>
        <interrupt name="TC1" index="20" module-instance="TC1" caption="Timer/Counter 1"/>
        <interrupt name="TC2" index="21" module-instance="TC2" caption="Timer/Counter 2"/>
        <interrupt name="TC3" index="22" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="ADCHS" index="23" module-instance="ADCHS" caption="Analog-to-Digital Converter"/>
        <interrupt name="AES" index="25" module-instance="AES" caption="Advanced Encryption Standard"/>
        <interrupt name="TRNG" index="26" module-instance="TRNG" caption="True Random Generator"/>
        <interrupt name="ICM" index="27" module-instance="ICM" caption="Integrity Check Monitor"/>
        <interrupt name="PUKCC" index="28" module-instance="PUKCC" caption="Public-Key Cryptography Controller"/>
        <interrupt name="QSPI" index="29" module-instance="QSPI" caption="Quad SPI interface"/>
        <interrupt name="ZB_INT0" index="30" module-instance="ZIGBEE" caption="ZIGBEE"/>
        <interrupt name="BT_INT0" index="31" module-instance="BLE" caption="Bluetooth 0"/>
        <interrupt name="BT_INT1" index="32" module-instance="BLE" caption="Bluetooth 0"/>
        <interrupt name="ARBITER" index="33" module-instance="ARB" caption="Radio Arbiter"/>
        <interrupt name="ADC_FAULT" index="34" module-instance="ADCHS" caption="ADC Fault Interrupt"/>
        <interrupt name="ADC_EOS" index="35" module-instance="ADCHS" caption="ADC EOS Interrupt"/>
        <interrupt name="ADC_BGVR_RDY" index="36" module-instance="ADCHS" caption="ADC BGVR Ready"/>
        <interrupt name="CLKI_WAKEUP_NMI" index="37" module-instance="BLE" caption="Bluetooth WAKEUP"/>
        <interrupt name="BT_LC" index="38" module-instance="BLE" caption="Bluetooth LC"/>
        <interrupt name="BT_RC" index="39" module-instance="BLE" caption="Bluetooth RC"/>
      </interrupts>
      <events>
        <generators>
          <generator name="RTC_PER_0" index="1" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="2" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="3" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="4" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="5" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="8" module-instance="RTC"/>
          <generator name="RTC_CMP_0" index="9" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="10" module-instance="RTC"/>
          <generator name="RTC_CMP_2" index="11" module-instance="RTC"/>
          <generator name="RTC_CMP_3" index="12" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="13" module-instance="RTC"/>
          <generator name="RTC_OVF" index="14" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="15" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="18" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="19" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="20" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="21" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="22" module-instance="DMAC"/>
          <generator name="PAC_ACCERR" index="23" module-instance="PAC"/>
          <generator name="TCC0_OVF" index="24" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="25" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="26" module-instance="TCC0"/>
          <generator name="TCC0_MC_0" index="27" module-instance="TCC0"/>
          <generator name="TCC0_MC_1" index="28" module-instance="TCC0"/>
          <generator name="TCC0_MC_2" index="29" module-instance="TCC0"/>
          <generator name="TCC0_MC_3" index="30" module-instance="TCC0"/>
          <generator name="TCC0_MC_4" index="31" module-instance="TCC0"/>
          <generator name="TCC0_MC_5" index="32" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="33" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="34" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="35" module-instance="TCC1"/>
          <generator name="TCC1_MCX_0" index="36" module-instance="TCC1"/>
          <generator name="TCC1_MCX_1" index="37" module-instance="TCC1"/>
          <generator name="TCC1_MCX_2" index="38" module-instance="TCC1"/>
          <generator name="TCC1_MCX_3" index="39" module-instance="TCC1"/>
          <generator name="TCC1_MCX_4" index="40" module-instance="TCC1"/>
          <generator name="TCC1_MCX_5" index="41" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="42" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="43" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="44" module-instance="TCC2"/>
          <generator name="TCC2_MCX_0" index="45" module-instance="TCC2"/>
          <generator name="TCC2_MCX_1" index="46" module-instance="TCC2"/>
          <generator name="TC0_OVF" index="47" module-instance="TC0"/>
          <generator name="TC0_MCX_0" index="48" module-instance="TC0"/>
          <generator name="TC0_MCX_1" index="49" module-instance="TC0"/>
          <generator name="TC1_OVF" index="50" module-instance="TC1"/>
          <generator name="TC1_MCX_0" index="51" module-instance="TC1"/>
          <generator name="TC1_MCX_1" index="52" module-instance="TC1"/>
          <generator name="TC2_OVF" index="53" module-instance="TC2"/>
          <generator name="TC2_MCX_0" index="54" module-instance="TC2"/>
          <generator name="TC2_MCX_1" index="55" module-instance="TC2"/>
          <generator name="TC3_OVF" index="56" module-instance="TC3"/>
          <generator name="TC3_MCX_0" index="57" module-instance="TC3"/>
          <generator name="TC3_MCX_1" index="58" module-instance="TC3"/>
          <generator name="ADC_RESRDY" index="59" module-instance="ADCHS"/>
          <generator name="AC_COMP_0" index="62" module-instance="AC"/>
          <generator name="AC_COMP_1" index="63" module-instance="AC"/>
          <generator name="AC_WIN_0" index="64" module-instance="AC"/>
          <generator name="TRNG_READY" index="65" module-instance="TRNG"/>
          <generator name="CCL_LUTOUT_0" index="66" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="67" module-instance="CCL"/>
          <generator name="ZB_TX_TS_ACT" index="68" module-instance="ZBT"/>
          <generator name="ZB_RX_TS_ACT" index="69" module-instance="ZBT"/>
        </generators>
        <users>
          <user name="RTC_TAMPER" index="0" module-instance="RTC"/>
          <user name="DMAC_CH_0" index="1" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="2" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="3" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="4" module-instance="DMAC"/>
          <user name="DMAC_CH_4" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_5" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_6" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_7" index="8" module-instance="DMAC"/>
          <user name="CM4_TRACE_START" index="9" module-instance="CM4"/>
          <user name="CM4_TRACE_STOP" index="10" module-instance="CM4"/>
          <user name="CM4_TRACE_TRIG" index="11" module-instance="CM4"/>
          <user name="TCC0_EV_0" index="12" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="13" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="14" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="15" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="16" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="17" module-instance="TCC0"/>
          <user name="TCC0_MC_4" index="18" module-instance="TCC0"/>
          <user name="TCC0_MC_5" index="19" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="20" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="21" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="22" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="23" module-instance="TCC1"/>
          <user name="TCC1_MC_2" index="24" module-instance="TCC1"/>
          <user name="TCC1_MC_3" index="25" module-instance="TCC1"/>
          <user name="TCC1_MC_4" index="26" module-instance="TCC1"/>
          <user name="TCC1_MC_5" index="27" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="28" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="29" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="30" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="31" module-instance="TCC2"/>
          <user name="TC0_EVU" index="32" module-instance="TC0"/>
          <user name="TC1_EVU" index="33" module-instance="TC1"/>
          <user name="TC2_EVU" index="34" module-instance="TC2"/>
          <user name="TC3_EVU" index="35" module-instance="TC3"/>
          <user name="ADC_TRIG_5" index="36" module-instance="ADCHS"/>
          <user name="ADC_TRIG_6" index="37" module-instance="ADCHS"/>
          <user name="ADC_TRIG_7" index="38" module-instance="ADCHS"/>
          <user name="ADC_TRIG_8" index="39" module-instance="ADCHS"/>
          <user name="ADC_TRIG_9" index="40" module-instance="ADCHS"/>
          <user name="ADC_TRIG_10" index="41" module-instance="ADCHS"/>
          <user name="ADC_TRIG_11" index="42" module-instance="ADCHS"/>
          <user name="ADC_TRIG_12" index="43" module-instance="ADCHS"/>
          <user name="ADC_TRIG_13" index="44" module-instance="ADCHS"/>
          <user name="ADC_TRIG_14" index="45" module-instance="ADCHS"/>
          <user name="ADC_TRIG_15" index="46" module-instance="ADCHS"/>
          <user name="ADC_TRIG_16" index="47" module-instance="ADCHS"/>
          <user name="AC_SOC_0" index="48" module-instance="AC"/>
          <user name="AC_SOC_1" index="49" module-instance="AC"/>
          <user name="CCL_LUTIN_0" index="50" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="51" module-instance="CCL"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x09B0B053"/>
          <property name="DSU_DID" value="0x00009B0B"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2501" version="1.0.0" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
