Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
      <value-group name="AC_COMPCTRL__FLEN">
        <value name="OFF" caption="No filtering" value="0"/>
        <value name="MAJ3" caption="3-bit majority function (2 of 3)" value="1"/>
        <value name="MAJ5" caption="5-bit majority function (3 of 5)" value="2"/>
      </value-group>
      <value-group name="AC_COMPCTRL__INTSEL">
        <value name="TOGGLE" caption="Interrupt on comparator output toggle" value="0"/>
        <value name="RISING" caption="Interrupt on comparator output rising" value="1"/>
        <value name="FALLING" caption="Interrupt on comparator output falling" value="2"/>
        <value name="EOC" caption="Interrupt on end of comparison (single-shot mode only)" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__MUXNEG">
        <value name="PIN0" caption="I/O pin 0" value="0"/>
        <value name="PIN1" caption="I/O pin 1" value="1"/>
        <value name="PIN2" caption="I/O pin 2" value="2"/>
        <value name="PIN3" caption="I/O pin 3" value="3"/>
        <value name="GND" caption="Ground" value="4"/>
        <value name="VSCALE" caption="VDD scaler" value="5"/>
        <value name="BANDGAP" caption="Internal bandgap voltage" value="6"/>
        <value name="DAC" caption="DAC output" value="7"/>
      </value-group>
      <value-group name="AC_COMPCTRL__MUXPOS">
        <value name="PIN0" caption="I/O pin 0" value="0"/>
        <value name="PIN1" caption="I/O pin 1" value="1"/>
        <value name="PIN2" caption="I/O pin 2" value="2"/>
        <value name="PIN3" caption="I/O pin 3" value="3"/>
        <value name="VSCALE" caption="VDD Scaler" value="4"/>
      </value-group>
      <value-group name="AC_COMPCTRL__OUT">
        <value name="OFF" caption="The output of COMPn is not routed to the COMPn I/O port" value="0"/>
        <value name="ASYNC" caption="The asynchronous output of COMPn is routed to the COMPn I/O port" value="1"/>
        <value name="SYNC" caption="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port" value="2"/>
      </value-group>
    </module>
    <module name="ADCHS" id="02508" version="1.0" caption="12-bit Analog to Digital Converter">
      <register-group name="ADCHS" caption="">
        <register name="ADCCON1" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield caption="DMA to System RAM Buffer Length Size bits" mask="0x00000007" name="DMABL" values="ADCCON1__DMABL"/>
          <bitfield caption="Scan Trigger High Level/Positive Edge Sensitivity bit" mask="0x00000008" name="STRGLVL" values="ADCCON1__STRGLVL"/>
          <bitfield caption="Interrupt Vector Shift bits" mask="0x00000070" name="IRQVS" values="ADCCON1__IRQVS"/>
          <bitfield name="SCANEN" caption="" mask="0x100"/>
          <bitfield name="FSYUPB" caption="" mask="0x200"/>
          <bitfield name="FSYDMA" caption="" mask="0x400"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="ADCCON1__SIDL"/>
          <bitfield name="FRZ" caption="" mask="0x4000"/>
          <bitfield caption="ADC Module Enable bit" mask="0x00008000" name="ON" values="ADCCON1__ON"/>
          <bitfield caption="Scan Trigger Source Select bits" mask="0x001F0000" name="STRGSRC" values="ADCCON1__STRGSRC"/>
          <bitfield caption="Shared ADC7 Resolution bits" mask="0x00600000" name="SELRES" values="ADCCON1__SELRES"/>
          <bitfield caption="Fractional Data Output Format bit" mask="0x00800000" name="FRACT" values="ADCCON1__FRACT"/>
        </register>
        <register name="ADCCON2" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield caption="Shared ADC Clock Divider bits" mask="0x0000007F" name="ADCDIV"/>
          <bitfield caption="Shared ADC Early Interrupt Select bits" mask="0x00000700" name="ADCEIS" values="ADCCON2__ADCEIS"/>
          <bitfield name="ENXCNVRT" caption="" mask="0x800"/>
          <bitfield caption="End of Scan Interrupt Enable bit" mask="0x00002000" name="EOSIEN" values="ADCCON2__EOSIEN"/>
          <bitfield caption="Band Gap/ Vref Voltage Fault Interrupt Enable bit" mask="0x00004000" name="REFFLTIEN" values="ADCCON2__REFFLTIEN"/>
          <bitfield caption="Band Gap/ Vref Voltage Ready Interrupt Enable bit" mask="0x00008000" name="BGVRIEN" values="ADCCON2__BGVRIEN"/>
          <bitfield caption="Sample Time for the Shared ADC (ADC7) bits" mask="0x03FF0000" name="SAMC"/>
          <bitfield caption="End of Scan Interrupt Status bit" mask="0x20000000" name="EOSRDY" values="ADCCON2__EOSRDY"/>
          <bitfield caption="Band Gap/ Vref / AVdd BOR Fault Status bit" mask="0x40000000" name="REFFLT" values="ADCCON2__REFFLT"/>
          <bitfield caption="Band Gap Voltage/ADC Reference Voltage Status bit" mask="0x80000000" name="BGVRRDY" values="ADCCON2__BGVRRDY"/>
        </register>
        <register name="ADCCON3" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield caption="Analog Input Select bits" mask="0x0000003F" name="ADINSEL" values="ADCCON3__ADINSEL"/>
          <bitfield caption="Global Software Trigger bit" mask="0x00000040" name="GSWTRG" values="ADCCON3__GSWTRG"/>
          <bitfield caption="Global Level Software Trigger bit" mask="0x00000080" name="GLSWTRG" values="ADCCON3__GLSWTRG"/>
          <bitfield caption="Individual ADC Input Conversion Request bit" mask="0x00000100" name="RQCNVRT" values="ADCCON3__RQCNVRT"/>
          <bitfield caption="Shared ADC7 Analog Input Sampling Enable bit " mask="0x00000200" name="SAMP" values="ADCCON3__SAMP"/>
          <bitfield caption="ADC Update Ready Status bit" mask="0x00000400" name="UPDRDY" values="ADCCON3__UPDRDY"/>
          <bitfield caption="Update Ready Interrupt Enable bit" mask="0x00000800" name="UPDIEN" values="ADCCON3__UPDIEN"/>
          <bitfield caption="Trigger Suspend bit" mask="0x00001000" name="TRGSUSP" values="ADCCON3__TRGSUSP"/>
          <bitfield caption="Voltage Reference Input Selection bits" mask="0x0000E000" name="VREFSEL" values="ADCCON3__VREFSEL"/>
          <bitfield caption="Shared ADC (ADC7) Digital Enable bit" mask="0x00800000" name="DIGEN7"/>
          <bitfield caption="Analog-to-Digital Control Clock Divider bits" mask="0x3F000000" name="CONCLKDIV"/>
          <bitfield caption="Analog-to-Digital Clock Source bits" mask="0xC0000000" name="ADCSEL" values="ADCCON3__ADCSEL"/>
        </register>
