Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__EDGESEL">
        <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
        <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event input source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="TCC" caption="TCC input source" value="8"/>
        <value name="SERCOM" caption="SERCOM input source" value="9"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INVEI">
        <value name="DISABLE" caption="Incoming event is not inverted" value="0"/>
        <value name="ENABLE" caption="Incoming event is inverted" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEI">
        <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
        <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEO">
        <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
        <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
      </value-group>
    </module>
    <module name="CFG" id="U500" version="1.0" caption="">
      <register-group name="CFG" caption="">
        <register name="CFGCON0" offset="0x0" rw="RW" size="4" access-size="4" initval="0x7100000b" caption="">
          <bitfield name="TDOEN" caption="TDO enable for 2-wire JTAG" mask="0x1"/>
          <bitfield name="SWOEN" caption="SWO enable on 2-wire debug interface" mask="0x2"/>
          <bitfield name="TROEN" caption="Trace Output Enable" mask="0x4"/>
          <bitfield name="JTAGEN" caption="JTAG Enable" mask="0x8"/>
          <bitfield name="ADCPOVR" caption="ADC Charge Pump Override" mask="0x10"/>
          <bitfield name="GPSOSCE" caption="GPIO/SOSC Enable" mask="0x20"/>
          <bitfield name="ACCMP1_ALTEN" caption="AC CMP1 Alternate Enable" mask="0x40"/>
          <bitfield name="CPENFILT" caption="ADC CP Filter Enable" mask="0x80"/>
          <bitfield name="RTCIN0_ALTEN" caption="RTCIN0 Alternate Enable" mask="0x100"/>
          <bitfield name="RTCOUT_ALTEN" caption="RTCOUT Alternate Enable" mask="0x200"/>
          <bitfield name="PMULOCK" caption="PMU Controller Register LOCK" mask="0x400"/>
          <bitfield name="PGLCOK" caption="Permission Group LOCK" mask="0x800"/>
          <bitfield name="PMDLOCK" caption="Peripheral Module Disable (PMD) LOCK" mask="0x1000"/>
          <bitfield name="IOLOCK" caption="IO LOCK" mask="0x2000"/>
          <bitfield name="CFGCLOCK" caption="Configuration Register Lock" mask="0xc000"/>
          <bitfield name="VBCMODE" caption="VBC Operating Mode" mask="0x10000"/>
          <bitfield name="SMBUSEN0" caption="SMBus Enable for SERCOM0" mask="0x20000"/>
          <bitfield name="SMBUSEN1" caption="SMBus Enable for SERCOM1" mask="0x40000"/>
          <bitfield name="HPLUGDIS" caption="Hot Plugging Disable" mask="0x100000"/>
          <bitfield name="SLRTEN0" caption="SLRT Enable for SERCOM0" mask="0x200000"/>
          <bitfield name="SLRTEN1" caption="SLRT Enable for SERCOM1" mask="0x400000"/>
          <bitfield name="PCM" caption="PCHE I/D Cacheable Mode" mask="0x1000000"/>
          <bitfield name="INT0E" caption="INT0 Enable" mask="0x2000000"/>
          <bitfield name="INT0P" caption="INT0P Polarity" mask="0x4000000"/>
          <bitfield name="FECCCON" caption="Flash ECC Control" mask="0x30000000"/>
          <bitfield name="FRECCDIS" caption="Flex RAM ECC Control" mask="0x40000000"/>
        </register>
        <register name="CFGCON1" offset="0x10" rw="RW" size="4" access-size="4" initval="0x1700443b" caption="">
          <bitfield name="DEBUG" caption="Background Debugger Access Selection" mask="0x3"/>
          <bitfield name="ICESEL" caption="EMUC/EMUD Communication Channel Select" mask="0x18"/>
          <bitfield name="TRCEN" caption="Trace Enable" mask="0x20"/>
          <bitfield name="ZBTWKSYS" caption="ZBT Subsystem External Wake-up source" mask="0x80"/>
          <bitfield name="CMP0_OE" caption="Analog Comparator-0 Output Enable" mask="0x100"/>
          <bitfield name="CMP1_OE" caption="Analog Comparator-1 Output Enable" mask="0x200"/>
          <bitfield name="CLASSBDIS" caption="Disable CLASSB Device Functionality" mask="0x400"/>
          <bitfield name="SLRCTRL0" caption="I2C Slew Rate Control for SERCOM0" mask="0x800"/>
          <bitfield name="SLRCTRL1" caption="I2C Slew Rate Control for SERCOM1" mask="0x1000"/>
          <bitfield name="SMCLR" caption="Selects CRU handling of MCLR Control" mask="0x4000"/>
          <bitfield name="QSCHE_EN" caption="QSPI Address Space Cache Attribute" mask="0x8000"/>
          <bitfield name="SCOM0_HSEN" caption="SERCOM0 (Direct)High Speed Pin Enable" mask="0x20000"/>
          <bitfield name="SCOM1_HSEN" caption="SERCOM1 (Direct)High Speed Pin Enable" mask="0x40000"/>
          <bitfield name="CCL_OE" caption="CCL Pads (via PPS) Output Enable" mask="0x100000"/>
          <bitfield name="I2CDSEL0" caption="I2C Delay Select for SERCOM0" mask="0x200000"/>
          <bitfield name="I2CDSEL1" caption="I2C Delay Select for SERCOM1" mask="0x400000"/>
          <bitfield name="WDTPSS" caption="Watchdog Timer Post-scale Select Sleep" mask="0x1f000000"/>
          <bitfield name="QSPIDDRM" caption="QSPI DDR Mode Clock Enable" mask="0x20000000"/>
          <bitfield name="CLKZBREF" caption="External Reference Clock ZB Enable" mask="0x40000000"/>
        </register>
        <register name="CFGCON2" offset="0x20" rw="RW" size="4" access-size="4" initval="0x7f7fff38" caption="">
          <bitfield name="ACMP_CYCLE" caption="AC SIB Comparator Result Wait Cycles" mask="0x7"/>
          <bitfield name="DMTINTV" caption="Dead Man Timer Count Window Interval" mask="0x38"/>
          <bitfield name="PMUTEST_VDD_EN" caption="PMU Test Output or VDD/2 Enable via ADC IE12" mask="0x80"/>
          <bitfield name="POSCMOD" caption="Primary Oscillator Configuration" mask="0x300"/>
          <bitfield name="WDTRMCS" caption="WDT RUN Mode Clock Select" mask="0xc00"/>
          <bitfield name="SOSCSEL" caption="SOSC Selection Configuration" mask="0x1000"/>
          <bitfield name="WAKE2SPD" caption="2-Speed startup enabled in Sleep mode" mask="0x2000"/>
          <bitfield name="CKSWEN" caption="Software Clock Switching Enable" mask="0x4000"/>
          <bitfield name="FSCMEN" caption="Fail-Safe Clock Monitor Enable" mask="0x8000"/>
          <bitfield name="WDTPSR" caption="Watchdog Timer Post-scale Select Run" mask="0x1f0000"/>
          <bitfield name="WDTSPGM" caption="Watchdog Timer Stop during Flash Programming" mask="0x200000"/>
          <bitfield name="WINDIS" caption="Windowed Watchdog Timer Disable" mask="0x400000"/>
          <bitfield name="WDTEN" caption="Watchdog Timer Enable" mask="0x800000"/>
          <bitfield name="WDTWINSZ" caption="Watchdog Timer Window Size" mask="0x3000000"/>
          <bitfield name="DMTCNT" caption="Dead Man Timer Count Select" mask="0x7c000000"/>
          <bitfield name="DMTEN" caption="Dead Man Timer Enable" mask="0x80000000"/>
        </register>
        <register name="CFGCON4" offset="0x40" rw="RW" size="4" access-size="4" initval="0x840e4000" caption="">
          <bitfield name="SOSCCFG" caption="SOSC Configuration" mask="0xff"/>
          <bitfield name="RTCEVENT_SEL" caption="RTC Event Selection" mask="0x300"/>
          <bitfield name="RTCEVENT_EN" caption="Pad Output Enable for MCHP legacy RTC event output" mask="0x400"/>
          <bitfield name="VBKP_1KCSEL" caption="VDDBUKPCORE LPCLK Clock Selection" mask="0x800"/>
          <bitfield name="VBKP_32KCSEL" caption="VDDBUKPCORE 32KHz clock source selection" mask="0x3000"/>
          <bitfield name="VBKP_DIVSEL" caption="VDDBUKPCORE LPCLK Clock Divider Selection" mask="0x4000"/>
          <bitfield name="LPCLK_MOD" caption="LPCLK modifier in counter/delay mode" mask="0x8000"/>
          <bitfield name="RTCEFTYPE" caption="RTC Event Type" mask="0x10000"/>
          <bitfield name="CPEN_DLY" caption="Charge-pump ready digital delay" mask="0xe0000"/>
          <bitfield name="DSZPBOREN" caption="Deep Sleep Zero-Power BOR Enable" mask="0x100000"/>
          <bitfield name="DSWDTPS" caption="Deep Sleep Watchdog Timer Postscale Select" mask="0x3e00000"/>
          <bitfield name="DSWDTOSC" caption="Deep Sleep Watchdog Timer Reference Clock Select" mask="0x4000000"/>
          <bitfield name="DSWDTEN" caption="Deep Sleep Watchdog Timer Enable" mask="0x8000000"/>
          <bitfield name="DSEN" caption="Deep Sleep Bit Enable" mask="0x10000000"/>
          <bitfield name="UVREGROVR" caption="ULPVREG Retention Mode Override" mask="0x20000000"/>
          <bitfield name="RTCNTM_CSEL" caption="RTC Counter Mode Clock Select" mask="0x80000000"/>
        </register>
        <register name="CFGPGQOS" offset="0x50" rw="RW" size="4" access-size="4" initval="0xe040004c" caption="">
          <bitfield name="CPUPG" caption="CPU (Code) Permission Group" mask="0x3"/>
          <bitfield name="CPUQOS" caption="CPU I/D and System Bus QOS Control" mask="0xc"/>
          <bitfield name="ICDJPG" caption="ICD-JTAG Permission Group" mask="0x30"/>
          <bitfield name="ICDJQOS" caption="ICD-JTAG Bus QOS Control" mask="0xc0"/>
          <bitfield name="DMAPG" caption="DMA (Rd/Wr) Permission Group" mask="0x300"/>
          <bitfield name="ADCPG" caption="ADC Controller Permission Group" mask="0x30000"/>
          <bitfield name="ADCQOS" caption="ADC Controller QOS Control" mask="0xc0000"/>
          <bitfield name="ICMPG" caption="ICM Permission Group" mask="0x300000"/>
          <bitfield name="ICMQOS" caption="ICM QOS Control" mask="0xc00000"/>
          <bitfield name="DSUPG" caption="DSU Permission Group" mask="0x3000000"/>
          <bitfield name="FCQOS" caption="FC Controller QOS Control" mask="0x30000000"/>
          <bitfield name="WISIBQOS" caption="Wireless SIB QOS Control" mask="0xc0000000"/>
        </register>
        <register name="CFGPCLKGEN1" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EICCSEL" caption="EIC Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EICCD" caption="EIC Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="FREQMRCSEL" caption="FREQMRC Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="RCD" caption="FREQMRC Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="FREQMMCSEL" caption="FREQMMC Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="MCD" caption="FREQMMC Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="SERCOM01CSEL" caption="SERCOM0/1 Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="S01CD" caption="SERCOM0/1 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="TCC12CSEL" caption="TCC1/2 Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TCC12CD" caption="TCC1/2 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="TC23CSEL" caption="TC2/3 Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="TC23CD" caption="TC2/3 Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="CM4TCSEL" caption="CM4T Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="CM4TD" caption="CM4T Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN2" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EVSYSC1SEL" caption="EVSYSC1 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="C1D" caption="EVSYSC1 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC2SEL" caption="EVSYSC2 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="C2D" caption="EVSYSC2 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC3SEL" caption="EVSYSC3 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="C3D" caption="EVSYSC3 Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC4SEL" caption="EVSYSC4 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="C4D" caption="EVSYSC4 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC5SEL" caption="EVSYSC5 Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="C5D" caption="EVSYSC5 Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC6SEL" caption="EVSYSC6 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="C6D" caption="EVSYSC6 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC7SEL" caption="EVSYSC7 Peripheral Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="C7D" caption="C7D Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC8SEL" caption="EVSYSC8 Peripheral Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="C8D" caption="C8D Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
