Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
        <register caption="" name="REFO1CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x74"> </register>
        <register caption="" name="REFO1CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x78"> </register>
        <register caption="" name="REFO1CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x7C"> </register>
        <register caption="REFERENCE OSCILLATOR 1 TRIM REGISTER" initval="0x0" name="REFO1TRIM" offset="0x80" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO1TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO1TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x84"> </register>
        <register caption="" name="REFO1TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x88"> </register>
        <register caption="" name="REFO1TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x8C"> </register>
        <register caption="REFERENCE OSCILLATOR 2 CONTROL REGISTER" initval="0x0" name="REFO2CON" offset="0x90" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO2CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO2CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO2CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO2CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO2CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO2CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO2CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO2CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO2CON__RODIV"/>
        </register>
        <register caption="" name="REFO2CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x94"> </register>
        <register caption="" name="REFO2CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x98"> </register>
        <register caption="" name="REFO2CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x9C"> </register>
        <register caption="REFERENCE OSCILLATOR 2 TRIM REGISTER" initval="0x0" name="REFO2TRIM" offset="0xa0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO2TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO2TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xa4"> </register>
        <register caption="" name="REFO2TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xa8"> </register>
        <register caption="" name="REFO2TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xaC"> </register>
        <register caption="REFERENCE OSCILLATOR 3 CONTROL REGISTER" initval="0x0" name="REFO3CON" offset="0xb0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO3CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO3CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO3CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO3CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO3CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO3CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO3CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO3CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO3CON__RODIV"/>
        </register>
        <register caption="" name="REFO3CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xb4"> </register>
        <register caption="" name="REFO3CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xb8"> </register>
        <register caption="" name="REFO3CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xbC"> </register>
        <register caption="REFERENCE OSCILLATOR 3 TRIM REGISTER" initval="0x0" name="REFO3TRIM" offset="0xc0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO3TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO3TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xc4"> </register>
        <register caption="" name="REFO3TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xc8"> </register>
        <register caption="" name="REFO3TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xcC"> </register>
        <register caption="REFERENCE OSCILLATOR 4 CONTROL REGISTER" initval="0x0" name="REFO4CON" offset="0xd0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO4CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO4CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO4CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO4CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO4CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO4CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO4CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO4CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO4CON__RODIV"/>
        </register>
        <register caption="" name="REFO4CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xd4"> </register>
        <register caption="" name="REFO4CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xd8"> </register>
        <register caption="" name="REFO4CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xdC"> </register>
        <register caption="REFERENCE OSCILLATOR 4 TRIM REGISTER" initval="0x0" name="REFO4TRIM" offset="0xe0" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO4TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO4TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xe4"> </register>
        <register caption="" name="REFO4TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xe8"> </register>
        <register caption="" name="REFO4TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xeC"> </register>
        <register caption="REFERENCE OSCILLATOR 5 CONTROL REGISTER" initval="0x0" name="REFO5CON" offset="0xf0" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO5CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO5CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO5CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO5CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO5CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO5CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO5CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO5CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO5CON__RODIV"/>
        </register>
