Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
        <register name="DMTCONCLR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCONSET" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCONINV" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTPRECLRCLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPRECLRSET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPRECLRINV" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTCLRCLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCLRSET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCLRINV" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTSTATCLR" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTSTATSET" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTSTATINV" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTCNTCLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCNTSET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCNTINV" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTHOLDREGCLR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTHOLDREGSET" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTHOLDREGINV" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTPSCNTCLR" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPSCNTSET" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPSCNTINV" offset="0x6c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTPSINTVCLR" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPSINTVSET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPSINTVINV" offset="0x7c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
      </register-group>
    </module>
    <module name="DSCON" id="01348" version="1.0" caption="">
      <register-group name="DSCON" caption="">
        <register name="DSCON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DSSR" caption="" mask="0x1"/>
          <bitfield name="ZPBOR" caption="" mask="0x2"/>
          <bitfield name="RTCCWDIS" caption="" mask="0x100"/>
          <bitfield name="RTCPWREQ" caption="" mask="0x1000"/>
          <bitfield name="XSEMAEN" caption="" mask="0x2000"/>
          <bitfield name="DSEN" caption="" mask="0x8000"/>
        </register>
        <register name="DSWAKE" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ICD" caption="" mask="0x2"/>
          <bitfield name="MCLR" caption="" mask="0x4"/>
          <bitfield name="RTCC" caption="" mask="0x8"/>
          <bitfield name="DSWDT" caption="" mask="0x10"/>
          <bitfield name="EXT" caption="" mask="0x20"/>
          <bitfield name="FAULT" caption="" mask="0x80"/>
          <bitfield name="INT0" caption="" mask="0x100"/>
        </register>
        <register name="DSSEMA1" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DSSEMA" caption="" mask="0xffffffff"/>
        </register>
        <register caption="" name="DSXSEMA1" offset="0x10" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="DSXSEMA"/>
        </register>
      </register-group>
    </module>
    <module name="DSU" id="U2410" version="1.0.0" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CRC" caption="32-bit Cyclic Redundancy Code" mask="0x4"/>
          <bitfield name="MBIST" caption="Memory built-in self-test" mask="0x8"/>
          <bitfield name="CE" caption="Chip-Erase" mask="0x10"/>
          <bitfield name="ARR" caption="Auxiliary Row Read" mask="0x40"/>
          <bitfield name="SMSA" caption="Start Memory Stream Access" mask="0x80"/>
        </register>
        <register name="STATUSA" offset="0x1" rw="RW" size="1" initval="0x00" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x10"/>
        </register>
        <register name="STATUSB" offset="0x2" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="PROT" caption="Protected" mask="0x1"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x10"/>
          <bitfield name="CELCK" caption="Chip Erase Locked" mask="0x20"/>
          <bitfield name="TDCCD0" caption="Test Debug Communication Channel 0 Dirty" mask="0x40"/>
          <bitfield name="TDCCD1" caption="Test Debug Communication Channel 1 Dirty" mask="0x80"/>
        </register>
