Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
      <value-group name="DEVCFG1__FMPDAEN">
        <value name="ON" caption="" value="0x1"/>
        <value name="OFF" caption="" value="0x0"/>
      </value-group>
      <value-group name="DEVCFG1__WDTPSS">
        <value name="PSS1" caption="1:1" value="0x0"/>
        <value name="PSS2" caption="1:2" value="0x1"/>
        <value name="PSS4" caption="1:4" value="0x2"/>
        <value name="PSS8" caption="1:8" value="0x3"/>
        <value name="PSS16" caption="1:16" value="0x4"/>
        <value name="PSS32" caption="1:32" value="0x5"/>
        <value name="PSS64" caption="1:64" value="0x6"/>
        <value name="PSS128" caption="1:128" value="0x7"/>
        <value name="PSS256" caption="1:256" value="0x8"/>
        <value name="PSS512" caption="1:512" value="0x9"/>
        <value name="PSS1024" caption="1:1024" value="0xA"/>
        <value name="PSS2048" caption="1:2048" value="0xB"/>
        <value name="PSS4096" caption="1:4096" value="0xC"/>
        <value name="PSS8192" caption="1:8192" value="0xD"/>
        <value name="PSS16384" caption="1:16384" value="0xE"/>
        <value name="PSS32768" caption="1:32768" value="0xF"/>
        <value name="PSS65536" caption="1:65536" value="0x10"/>
        <value name="PSS131072" caption="1:131072" value="0x11"/>
        <value name="PSS262144" caption="1:262144" value="0x12"/>
        <value name="PSS524288" caption="1:524288" value="0x13"/>
        <value name="PSS1048576" caption="1:1048576" value="0x14"/>
      </value-group>
      <!-- DEVCFG2 -->
      <value-group caption="Analog Comparator Result Wait Cycles" name="DEVCFG2__ACMP_CYCLE">
        <value caption="32us" name="_32US" value="0x0"/>
        <value caption="64us" name="_64US" value="0x1"/>
        <value caption="96us" name="_96US" value="0x2"/>
        <value caption="128us" name="_128US" value="0x3"/>
        <value caption="160us" name="_160US" value="0x4"/>
        <value caption="196us" name="_196US" value="0x5"/>
        <value caption="224us" name="_224US" value="0x6"/>
        <value caption="256us" name="_256US" value="0x7"/>
      </value-group>
      <value-group caption="PMU Test Output or VDD div 2 Enable via ADC IE12" name="DEVCFG2__PMUTEST_VDD_EN">
        <value caption="PMU Test Output Monitor" name="PMU" value="0x1"/>
        <value caption="VDD_div_2 Monitor" name="VDD_DIV_2" value="0x0"/>
      </value-group>
      <value-group caption="WDT RUN Mode Clock Select" name="DEVCFG2__WDTRMCS">
        <value caption="LPRC" name="LPRC" value="0x3"/>
        <value caption="SYSCLK" name="SYSCLK" value="0x0"/>
      </value-group>
      <value-group caption="SOSC Selection Configuration" name="DEVCFG2__SOSCSEL">
        <value caption="" name="XTAL" value="0x1"/>
        <value caption="" name="SCLKI" value="0x0"/>
      </value-group>
      <value-group caption="2-Speed startup enabled in Sleep mode" name="DEVCFG2__WAKE2SPD">
        <value caption="" name="ON" value="0x1"/>
        <value caption="" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Software Clock Switching Enable" name="DEVCFG2__CKSWEN">
        <value caption="" name="ON" value="0x1"/>
        <value caption="" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Fail-Safe Clock Monitor Enable" name="DEVCFG2__FSCMEN">
        <value caption="" name="ON" value="0x1"/>
        <value caption="" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Stop during Flash Programming" name="DEVCFG2__WDTSPGM">
        <value caption="" name="STOPS" value="0x1"/>
        <value caption="" name="RUNS" value="0x0"/>
      </value-group>
      <value-group caption="Windowed Watchdog Timer Disable" name="DEVCFG2__WINDIS">
        <value caption="" name="NORMAL" value="0x1"/>
        <value caption="" name="WINDOW" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Enable" name="DEVCFG2__WDTEN">
        <value caption="" name="ON" value="0x1"/>
        <value caption="" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Dead Man Timer Enable" name="DEVCFG2__DMTEN">
        <value caption="" name="ON" value="0x1"/>
        <value caption="" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Primary Oscillator Configuration" name="DEVCFG2__POSCMOD">
        <value caption="" name="OFF" value="0x3"/>
        <value caption="" name="HS" value="0x0"/>
      </value-group>
      <value-group caption="DMT Count Window Interval" name="DEVCFG2__DMTINTV">
        <value caption="Window/Interval value is zero" name="WIN_0" value="0x0"/>
        <value caption="Window/Interval value is 1/2 counter value" name="WIN_1_2" value="0x1"/>
        <value caption="Window/Interval value is 3/4 counter value" name="WIN_3_4" value="0x2"/>
        <value caption="Window/Interval value is 7/8 counter value" name="WIN_7_8" value="0x3"/>
        <value caption="Window/Interval value is 15/16 counter value" name="WIN_15_16" value="0x4"/>
        <value caption="Window/Interval value is 31/32 counter value" name="WIN_31_32" value="0x5"/>
        <value caption="Window/Interval value is 63/64 counter value" name="WIN_63_64" value="0x6"/>
        <value caption="Window/Interval value is 127/128 counter value" name="WIN_127_128" value="0x7"/>
      </value-group>
      <value-group caption="Run mode watchdog timer postscaler" name="DEVCFG2__WDTPSR">
        <value caption="1:1" name="PS1" value="0x0"/>
        <value caption="1:2" name="PS2" value="0x1"/>
        <value caption="1:4" name="PS4" value="0x2"/>
        <value caption="1:8" name="PS8" value="0x3"/>
        <value caption="1:16" name="PS16" value="0x4"/>
        <value caption="1:32" name="PS32" value="0x5"/>
        <value caption="1:64" name="PS64" value="0x6"/>
        <value caption="1:128" name="PS128" value="0x7"/>
        <value caption="1:256" name="PS256" value="0x8"/>
        <value caption="1:512" name="PS512" value="0x9"/>
        <value caption="1:1024" name="PS1024" value="0xa"/>
        <value caption="1:2048" name="PS2048" value="0xb"/>
        <value caption="1:4096" name="PS4096" value="0xc"/>
        <value caption="1:8192" name="PS8192" value="0xd"/>
        <value caption="1:16384" name="PS16384" value="0xe"/>
        <value caption="1:32768" name="PS32768" value="0xf"/>
        <value caption="1:65536" name="PS65536" value="0x10"/>
        <value caption="1:131072" name="PS131072" value="0x11"/>
        <value caption="1:262144" name="PS262144" value="0x12"/>
        <value caption="1:524288" name="PS524288" value="0x13"/>
        <value caption="1:1048576" name="PS1048576" value="0x14"/>
      </value-group>
      <value-group caption="Watchdog Timer Window Size" name="DEVCFG2__WDTWINSZ">
        <value caption="Window size is 25%" name="WINSZ_25" value="0x3"/>
        <value caption="Window size is 37.5%" name="WINSZ_37" value="0x2"/>
        <value caption="Window size is 50%" name="WINSZ_50" value="0x1"/>
        <value caption="Window size is 75%" name="WINSZ_75" value="0x0"/>
      </value-group>
