Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
        <register name="MODECTRL4" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VREG4CTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3CTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2CTRL" caption="" mask="0x1f0000"/>
          <bitfield name="VREG1CTRL" caption="" mask="0x1f000000"/>
          <bitfield name="BUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="MLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="BUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="OVERCTRL" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VREG4OCTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3OCTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2OCTRL" caption="" mask="0x1f0000"/>
          <bitfield name="PHWC" caption="" mask="0x400000"/>
          <bitfield name="OVEREN" caption="" mask="0x800000"/>
          <bitfield name="VREG1OCTRL" caption="" mask="0x1f000000"/>
          <bitfield name="OBUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="OMLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="OBUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="PMUCMODE" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CVREG4OCTRL" caption="" mask="0x1f"/>
          <bitfield name="CVREG3OCTRL" caption="" mask="0x1f00"/>
          <bitfield name="CVREG2OCTROL" caption="" mask="0x1f0000"/>
          <bitfield name="ADCBOR" caption="" mask="0x200000"/>
          <bitfield name="BUCKBOR" caption="" mask="0x400000"/>
          <bitfield name="MLDOEXTBOR" caption="" mask="0x800000"/>
          <bitfield name="CVREG1OCTRL" caption="" mask="0x1f000000"/>
          <bitfield name="CBUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="CMLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="CBUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="PMUSTATUS" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PMUSTATUS" caption="" mask="0x1f"/>
          <bitfield name="WCMRM" caption="" mask="0x20"/>
          <bitfield name="PMUANA_BUCKBOR" caption="" mask="0x40"/>
          <bitfield name="BSSEDATA" caption="" mask="0xffff00"/>
          <bitfield name="BSSENUM" caption="" mask="0x7f000000"/>
          <bitfield name="BSSERR" caption="" mask="0x80000000"/>
        </register>
        <register name="PMUSEQ1" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ2" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ3" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ4" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUCFG" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="BUCK_SW_DELAY" caption="" mask="0x7f"/>
          <bitfield name="MLDO_SW_DELAY" caption="" mask="0x3f00"/>
          <bitfield name="MLDOEXT_l" caption="" mask="0xc000"/>
          <bitfield name="BUCK_CP_L" caption="" mask="0xf0000"/>
          <bitfield name="BUCK_CP_H" caption="" mask="0xf00000"/>
          <bitfield name="ADC_CP_L" caption="" mask="0xf000000"/>
          <bitfield name="ADC_CP_H" caption="" mask="0xf0000000"/>
        </register>
        <register name="PMU_WCMCMD" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="WCMADDR" caption="" mask="0x7ff"/>
          <bitfield name="WCMCLKDIV" caption="" mask="0x70000"/>
          <bitfield name="WCMRDU" caption="" mask="0x10000000"/>
          <bitfield name="CMD" caption="" mask="0x40000000"/>
          <bitfield name="MODE" caption="" mask="0x80000000"/>
        </register>
        <register name="PMU_WCMWDATA" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="WCMWDATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="PMU_WCMRDATA" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="WCMRDATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="PMU_VBCCMD" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VBCADDR" caption="" mask="0xffff"/>
          <bitfield name="VBCRDY" caption="" mask="0x10000000"/>
          <bitfield name="CMD" caption="" mask="0x40000000"/>
        </register>
