Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
        <register name="CCLIN3R" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN3" caption="CCL/IN3" mask="0xf" values="CCLIN3_PINS"/>
        </register>
        <register name="CCLIN4R" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN4" caption="CCL/IN4" mask="0xf" values="CCLIN4_PINS"/>
        </register>
        <register name="CCLIN5R" offset="0xac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN5" caption="CCL/IN5" mask="0xf" values="CCLIN5_PINS"/>
        </register>
        <register name="TC0WO0G1R" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0" caption="TC0/WO0G1" mask="0xf" values="TC0WO0G1_PINS"/>
        </register>
        <register name="TC0WO0G2R" offset="0xb4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0" caption="TC0/WO0G2" mask="0xf" values="TC0WO0G2_PINS"/>
        </register>
        <register name="TC0WO1G3R" offset="0xb8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1" caption="TC0/WO1G3" mask="0xf" values="TC0WO1G3_PINS"/>
        </register>
        <register name="TC0WO1G4R" offset="0xbc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1" caption="TC0/WO1G4" mask="0xf" values="TC0WO1G4_PINS"/>
        </register>
        <register name="TC1WO0G1R" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO0" caption="TC1/WO0G1" mask="0xf" values="TC1WO0G1_PINS"/>
        </register>
        <register name="TC1WO1G2R" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO1" caption="TC1/WO1G2" mask="0xf" values="TC1WO1G2_PINS"/>
        </register>
        <register name="TC2WO0G1R" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0" caption="TC2/WO0G1" mask="0xf" values="TC2WO0G1_PINS"/>
        </register>
        <register name="TC2WO0G3R" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0" caption="TC2/WO0G3" mask="0xf" values="TC2WO0G3_PINS"/>
        </register>
        <register name="TC2WO1G2R" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1" caption="TC2/WO1G2" mask="0xf" values="TC2WO1G2_PINS"/>
        </register>
        <register name="TC2WO1G4R" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1" caption="TC2/WO1G4" mask="0xf" values="TC2WO1G4_PINS"/>
        </register>
        <register name="TC3WO0G1R" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0" caption="TC3/WO0G1" mask="0xf" values="TC3WO0G1_PINS"/>
        </register>
        <register name="TC3WO0G3R" offset="0xdc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0" caption="TC3/WO0G3" mask="0xf" values="TC3WO0G3_PINS"/>
        </register>
        <register name="TC3WO1G2R" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1" caption="TC3/WO1G2" mask="0xf" values="TC3WO1G2_PINS"/>
        </register>
        <register name="TC3WO1G4R" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1" caption="TC3/WO1G4" mask="0xf" values="TC3WO1G4_PINS"/>
        </register>
        <!-- Next lines are OUTPUT pin mappings -->
        <register name="RPA3G1R" offset="0x218" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G1R" caption="RPA3/G1" mask="0x1f" values="RPA3G1_PINS"/>
        </register>
        <register name="RPA3G2R" offset="0x21c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G2R" caption="RPA3/G2" mask="0x1f" values="RPA3G2_PINS"/>
        </register>
        <register name="RPA3G3R" offset="0x220" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G3R" caption="RPA3/G3" mask="0x1f" values="RPA3G3_PINS"/>
        </register>
        <register name="RPA4G2R" offset="0x224" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G2R" caption="RPA4/G2" mask="0x1f" values="RPA4G2_PINS"/>
        </register>
        <register name="RPA4G3R" offset="0x228" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G3R" caption="RPA4/G3" mask="0x1f" values="RPA4G3_PINS"/>
        </register>
        <register name="RPA4G4R" offset="0x22c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G4R" caption="RPA4/G4" mask="0x1f" values="RPA4G4_PINS"/>
        </register>
        <register name="RPA5G1R" offset="0x230" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G1R" caption="RPA5/G1" mask="0x1f" values="RPA5G1_PINS"/>
        </register>
        <register name="RPA5G3R" offset="0x234" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G3R" caption="RPA5/G3" mask="0x1f" values="RPA5G3_PINS"/>
        </register>
        <register name="RPA5G4R" offset="0x238" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G4R" caption="RPA5/G4" mask="0x1f" values="RPA5G4_PINS"/>
        </register>
        <register name="RPA6G1R" offset="0x23c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G1R" caption="RPA6/G1" mask="0x1f" values="RPA6G1_PINS"/>
        </register>
        <register name="RPA6G2R" offset="0x240" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G2R" caption="RPA6/G2" mask="0x1f" values="RPA6G2_PINS"/>
        </register>
