Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
      <value-group name="TCC_EVCTRL__CNTSEL">
        <value name="START" caption="An interrupt/event is generated when a new counter cycle starts" value="0"/>
        <value name="END" caption="An interrupt/event is generated when a counter cycle ends" value="1"/>
        <value name="BETWEEN" caption="An interrupt/event is generated when a counter cycle ends, except for the first and last cycles" value="2"/>
        <value name="BOUNDARY" caption="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" value="3"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT0">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or re-trigger counter on event" value="1"/>
        <value name="COUNTEV" caption="Count on event" value="2"/>
        <value name="START" caption="Start counter on event" value="3"/>
        <value name="INC" caption="Increment counter on event" value="4"/>
        <value name="COUNT" caption="Count on active state of asynchronous event" value="5"/>
        <value name="STAMP" caption="Stamp capture" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT1">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Re-trigger counter on event" value="1"/>
        <value name="DIR" caption="Direction control" value="2"/>
        <value name="STOP" caption="Stop counter on event" value="3"/>
        <value name="DEC" caption="Decrement counter on event" value="4"/>
        <value name="PPW" caption="Period capture value in CC0 register, pulse width capture value in CC1 register" value="5"/>
        <value name="PWP" caption="Period capture value in CC1 register, pulse width capture value in CC0 register" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="TCC_WAVE__RAMP">
        <value name="RAMP1" caption="RAMP1 operation" value="0"/>
        <value name="RAMP2A" caption="Alternative RAMP2 operation" value="1"/>
        <value name="RAMP2" caption="RAMP2 operation" value="2"/>
        <value name="RAMP2C" caption="Critical RAMP2 operation" value="3"/>
      </value-group>
      <value-group name="TCC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal frequency" value="0"/>
        <value name="MFRQ" caption="Match frequency" value="1"/>
        <value name="NPWM" caption="Normal PWM" value="2"/>
        <value name="DSCRITICAL" caption="Dual-slope critical" value="4"/>
        <value name="DSBOTTOM" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO" value="5"/>
        <value name="DSBOTH" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" value="6"/>
        <value name="DSTOP" caption="Dual-slope with interrupt/event condition when COUNT reaches TOP" value="7"/>
      </value-group>
    </module>
    <module name="TRNG" id="U2242" version="1.1.0" caption="True Random Generator">
      <register-group name="TRNG" caption="True Random Generator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="DATARDYEO" caption="Data Ready Event Output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="DATARDY" caption="Data Ready Interrupt Flag" mask="0x1"/>
        </register>
        <register name="DATA" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Output Data">
          <bitfield name="DATA" caption="Output Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="WDT" id="02674" caption="Watch Dog Timer">
      <register-group name="WDT">
        <register name="WDTCON" offset="0x0" rw="RW" size="4" caption="Watchdog Timer Control Register">
          <bitfield caption="Watchdog Timer Window Enable bit" mask="0x00000001" name="WDTWINEN" values="WDTCON__WDTWINEN"/>
          <bitfield name="SLPDIV" caption="" mask="0x3e"/>
          <bitfield name="CLKSEL" caption="" mask="0xc0"/>
          <bitfield name="RUNDIV" caption="" mask="0x1f00"/>
          <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="ON" values="WDTCON__ON"/>
          <bitfield name="WDTCLRKEY" caption="" mask="0xffff0000"/>
        </register>
        <register name="WDTCONCLR" offset="0x04" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="WDTCONSET" offset="0x08" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="WDTCONINV" offset="0x0C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
      </register-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="WDTCON__WDTWINEN">
        <value caption="Enable windowed Watchdog Timer" name="WDTWINEN" value="0x1"/>
        <value caption="Disable windowed Watchdog Timer" name="WDTWINDIS" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="WDTCON__ON">
        <value caption="The WDT module is enabled" name="WDTEN" value="0x1"/>
        <value caption="The WDT module is disabled" name="WDTOFF" value="0x0"/>
      </value-group>
    </module>
    <module name="ARB" id="U9999" version="1.0" caption="Radio Arbiter">
      <register-group name="ARB" caption="">
        <register name="ARB_BT_CTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0000000A" caption="">
          <bitfield name="MAX_ABORT_TIME_BT" caption="BT max abort time" mask="0xFF"/>
          <bitfield name="ALLOW_OPT_RX_BT" caption="BT allow optimistic rx" mask="0x100"/>
          <bitfield name="ALLOW_OPT_TX_BT" caption="BT allow optimistic tx" mask="0x200"/>
        </register>
        <register name="ARB_ZB_CTRL" offset="0x4" rw="RW" size="4" access-size="4" initval="0x0000000A" caption="">
          <bitfield name="MAX_ABORT_TIME_ZB" caption="ZB max abort time" mask="0xFF"/>
          <bitfield name="ALLOW_OPT_RX_ZB" caption="ZB allow optimistic rx" mask="0x100"/>
          <bitfield name="ALLOW_OPT_TX_ZB" caption="ZB allow optimistic tx" mask="0x200"/>
        </register>
