Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.2.230/BZ24/atdf/PIC32CX1012BZ24032.atdf
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
    <module name="ZIGBEE" version="1.0.0" caption="ZIGBEE Radio Registers">
      <register-group name="ZIGBEE" caption="Zero Radio Registers"/>
    </module>
  </modules>
  <pinouts>
    <pinout name="QFN32" caption="QFN32">
      <pin position="1" pad="PMU_VDD"/>
      <pin position="2" pad="PMU_MDLO_OUT"/>
      <pin position="3" pad="PA05"/>
      <pin position="4" pad="VDD"/>
      <pin position="5" pad="PA06"/>
      <pin position="6" pad="PA07"/>
      <pin position="7" pad="PA08"/>
      <pin position="8" pad="PA09"/>
      <pin position="9" pad="PA10"/>
      <pin position="10" pad="VDDCORE"/>
      <pin position="11" pad="BUCK_CLDO"/>
      <pin position="12" pad="EXT48K"/>
      <pin position="13" pad="BUCK_BB"/>
      <pin position="14" pad="XO_N"/>
      <pin position="15" pad="XO_P"/>
      <pin position="16" pad="BUCK_PLL"/>
      <pin position="17" pad="BUCK_LPA"/>
      <pin position="18" pad="LPA_OUT"/>
      <pin position="19" pad="NMCLR"/>
      <pin position="20" pad="PB00"/>
      <pin position="21" pad="PB01"/>
      <pin position="22" pad="PB04"/>
      <pin position="23" pad="PB05"/>
      <pin position="24" pad="AVDD"/>
      <pin position="25" pad="PB06"/>
      <pin position="26" pad="PB07"/>
      <pin position="27" pad="PB09"/>
      <pin position="28" pad="PB08"/>
      <pin position="29" pad="PA04"/>
      <pin position="30" pad="PA03"/>
      <pin position="31" pad="PMU_VDDIO"/>
      <pin position="32" pad="PMU_BUCK_LX"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
